Autodesk.Revit.DB.Fabrication.FabricationUtils.CreateFabricationJob(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
saves passed fabrication parts in a the native fabrication archived job (ESJ) format.
ids:
list of FabricationPart element Ids, non-fabrication parts are ignored.
filename:
filename is used for the job file name.
Returns:
returns true if file created succesfully, returns false if no valid fabrication parts or unable to create the file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils.ValidateConnectivity(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Check if two connectors are valid to connect directly without couplings
pAdoc:
The document.
pConn1:
First connector to check.
pConn2:
Second connector to check against.
Returns:
True if connection is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016